CF/InformationRegisters/ГрафикиРаботыМагазинов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиРаботыМагазинов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пятидневка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Шестидневка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КалендарныеДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДнейПроизводственногоКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочийДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидГрафикаРаботы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыГрафиковРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаКалендаря</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CF/Enums/ВидыДнейПроизводственногоКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыДнейПроизводственногоКалендаря</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
					<Comment>Рабочий день</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Суббота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воскресенье</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предпраздничный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Праздник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нерабочий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/Enums/ВидыГрафиковРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыГрафиковРаботы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пятидневка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шестидневка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/InformationRegisters/ГрафикиРаботыМагазинов/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает график работы магазина.
//
// Параметры:
//	Магазин			- СправочникСсылка.Магазины
//	НомерГода		- Номер года, за который необходимо прочитать календарь.
//
// Возвращаемое значение
//	ТаблицаЗначений	- график работы магазина.
//
Функция ГрафикРаботыМагазина(Магазин, НомерГода) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("НомерГода", НомерГода);
	Запрос.УстановитьПараметр("Магазин",  Магазин);
	Запрос.УстановитьПараметр("ПустойМагазин", Магазин.Пустая());
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГрафикиРаботыМагазинов.ДатаКалендаря    КАК ДатаКалендаря,
	|	ГрафикиРаботыМагазинов.ВидДня           КАК ВидДня,
	|	ГрафикиРаботыМагазинов.ВидГрафикаРаботы КАК ВидГрафикаРаботы,
	|	ГрафикиРаботыМагазинов.Магазин          КАК Магазин
	|ИЗ
	|	РегистрСведений.ГрафикиРаботыМагазинов КАК ГрафикиРаботыМагазинов
	|ГДЕ
	|	ГрафикиРаботыМагазинов.Год = &НомерГода
	|	И ГрафикиРаботыМагазинов.Магазин = &Магазин
	|	И НЕ &ПустойМагазин
	|";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Записывает данные графика в регистр.
//
// Параметры:
//	Магазин		- СправочникСсылка.Магазины
//	НомерГода	- Номер года, за который необходимо записать календарь.
//	СписокДат	- список значений, в котором указано, какие даты входят в календарь.
//
Процедура ЗаписатьДанныеГрафикаВРегистр(Магазин, НомерГода, ТаблицаРегистра) Экспорт
	
	НаборЗаписей = РегистрыСведений.ГрафикиРаботыМагазинов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Магазин.Установить(Магазин);
	НаборЗаписей.Отбор.Год.Установить(НомерГода);
	
	Для Каждого СтрокаТаблицыРегистра Из ТаблицаРегистра Цикл
		
		Строка = НаборЗаписей.Добавить();
		Строка.Магазин          = Магазин;
		Строка.Год              = НомерГода;
		Строка.ДатаКалендаря    = СтрокаТаблицыРегистра.ДатаКалендаря;
		Строка.ВидДня           = СтрокаТаблицыРегистра.ВидДня;
		Строка.ВидГрафикаРаботы = СтрокаТаблицыРегистра.ВидГрафикаРаботы;
		ЗаполнитьРесурсыЗаписиРегистра(Строка);
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

// Заполняет ресурсы "Пятидневка", "Шестидневка" и "КалендарныеДни".
//
Процедура ЗаполнитьРесурсыЗаписиРегистра(ЗаписьРегистра) Экспорт
	
	// рабочий день
	Если ЗаписьРегистра.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий ИЛИ
		
		ЗаписьРегистра.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный Тогда
		
		ЗаписьРегистра.Пятидневка     = 1;
		ЗаписьРегистра.Шестидневка    = 1;
		ЗаписьРегистра.КалендарныеДни = 1;
		
		ЗаписьРегистра.РабочийДень = 1;
		
		// суббота
	ИначеЕсли ЗаписьРегистра.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота Тогда
		
		ЗаписьРегистра.Пятидневка  = 0;
		ЗаписьРегистра.Шестидневка = 1;
		ЗаписьРегистра.КалендарныеДни = 1;
		
		Если ЗаписьРегистра.ВидГрафикаРаботы = Перечисления.ВидыГрафиковРаботы.Пятидневка Тогда
			
			ЗаписьРегистра.РабочийДень = 0;
			
		Иначе
			
			ЗаписьРегистра.РабочийДень = 1;
			
		КонецЕсли;
		
		// воскресение
	ИначеЕсли ЗаписьРегистра.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье Тогда
		
		ЗаписьРегистра.Пятидневка  = 0;
		ЗаписьРегистра.Шестидневка = 0;
		ЗаписьРегистра.КалендарныеДни = 1;
		
		Если ЗаписьРегистра.ВидГрафикаРаботы = Перечисления.ВидыГрафиковРаботы.Пятидневка
		ИЛИ  ЗаписьРегистра.ВидГрафикаРаботы = Перечисления.ВидыГрафиковРаботы.Шестидневка Тогда
		
		ЗаписьРегистра.РабочийДень = 0;
			
		Иначе
			
			ЗаписьРегистра.РабочийДень = 1;
			
		КонецЕсли;
		
		// праздничный день
	Иначе
		
		ЗаписьРегистра.Пятидневка  = 0;
		ЗаписьРегистра.Шестидневка = 0;
		ЗаписьРегистра.КалендарныеДни = 0;
		
		ЗаписьРегистра.РабочийДень = 0;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
